Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/civil_partnerships/civil_partnership_and_same_sex_couples.html.txt.tmx
Source language: en
Languages: ga

source: Civil partnership and same-sex couples
ga: Páirtnéireacht shibhialta agus lánúineacha comhghnéis

source: A statutory civil partnership registration scheme for same-sex couples was introduced in January 2011 under the Civil Partnership and Certain Rights and Obligations of Cohabitants Act 2010
ga: Tugadh isteach scéim chlárúcháin páirtnéireachta sibhialta reachtúla do lánúineacha chomhghnéis in Eanáir 2011 faoin Acht um Páirtnéireacht Shibhialta agus Cearta agus Oibleagáidí Áirithe de chuid Comhchónaitheoirí, 2010

source: The Act sets out the rights and obligations that civil partners have towards each other
ga: Leagtar amach san Acht na cearta agus na hoibleagáidí atá ag páirtnéirí sibhialta dá chéile

source: These are broadly the same as the rights and obligations of married couples towards each
ga: Is ionann atá iad seo, den chuid is mó, agus na cearta agus na hoibleagáidí atá ag lánúineacha pósta dá chéile

source: The Act did not change the law on issues relating to children, for example, guardianship, adoption, custody, access or maintenance
ga: Níor athraíonn an tAcht an dlí ar shaincheisteanna i ndáil le leanaí, mar shampla, caomhnóireacht, uchtú, cúram, rochtain ná cothabháil

source: Civil partners are treated in the same way as spouses under the tax and social welfare codes
ga: Caitear le páirtnéirí sibhialta ar an mbealach céanna le céilí faoi chóid chánach agus leasa shóisialaigh

source: Necessary changes to the social welfare codes were made through the Social Welfare and Pensions Act 2010
ga: Rinneadh athruithe riachtanacha ar na cóid leasa shóisialaigh tríd an Acht Leasa Shóisialaigh agus Pinsean, 2010

source: Taxation changes were made through the Finance (No
ga: Rinneadh athruithe cánachas tríd an Acht Airgeadais (Uimh

source: See Revenue's Frequently Asked Questions on Civil Partnership (pdf)
ga: Féach Ceisteanna Coitianta ar Pháirtnéireacht Shibhialta (pdf) na gCoimisinéirí Ioncaim

source: The Minister for Justice and Equality made orders recognising as civil partnerships classes of legal relationships which were registered in other countries and which met certain criteria
ga: Tá orduithe déanta ag an Aire Dlí agus Cirt agus Comhionannais ina n-aithnítear páirtnéireachtaí sibhialta mar aicmí de chaidreamh dlíthiúil a chláraítear i dtíortha eile agus a chomhlíonann critéir ar leith

source: Following the commencement of the Marriage Act 2015 on 16 November 2015 you can no longer register a civil partnership
ga: I ndiaidh gur cuireadh tús leis an Acht um Pósadh, 2015 ar 16 Samhain 2015 ní féidir leat páirtnéireacht shibhialta a chlárú

source: Couples already in a civil partnership can apply to marry or remain as they are
ga: Féadfaidh lánúineacha atá i bpáirtnéireacht shibhialta cheana féin iarratas a dhéanamh chun pósadh nó fanacht mar atá siad

source: If they marry their civil partnership is automatically dissolved
ga: Má phósann siad, déantar a bpáirtnéireacht shibhialta a scaoileadh go huathoibríoch

source: Partnerships registered abroad since 16 May 2016 are not recognised as civil partnerships in Ireland
ga: Ní aithnítear páirtnéireachtaí a chláraítear thar lear ón 16 Samhain 2015 ar aghaidh mar pháirtnéireachtaí sibhialta in Éirinn

source: You can find more information on the Department of Justice and Equality website
ga: Féadfaidh tú teacht ar bhreis faisnéise ar láithreán gréasáin na Roinne Dlí agus Cirt agus Comhionannais

source: Registering of civil partnershipships
ga: Páirtnéireachtaí sibhialta a chlárú

source: Under the scheme same-sex couples could register their relationship as a civil partnership
ga: Faoin scéim, is féidir le lánúineacha comhghnéis a gcaidreamh a chlárú mar pháirtnéireacht shibhialta

source: The Registrar-General is obliged to maintain a register of civil partnerships, a register of decrees of dissolution of civil partnerships and a register of nullity of civil partnerships
ga: Tá ar an Ard-Chláraitheoir clár de pháirtnéireachtaí sibhialta, clár d’fhoraitheanta scaoilte páirtnéireachtaí sibhialta agus clár de neamhniú páirtnéireachtaí sibhialta a choinneáil

source: The registration rules and processes were broadly similar to those for the registration of a civil marriage, annulments of marriage and divorce
ga: Bhí na rialacha agus próisis chláraithe, den chuid ba mhó, mar an gcéanna leo siúd chun phósadh sibhialta, neamhniú pósta agus colscaradh a chlárú

source: There were various reasons why you would not be allowed to become civil partners – legally, these were known as impediments
ga: Tá fáthanna éagsúla ann nach gceadófaí duit bheith i do pháirtnéir sibhialta – i dtaobh an dlí de, tugtar constaicí orthu seo

source: The main ones were age, close blood relationship and an existing valid marriage or civil partnership
ga: Ba iad na príomhchonstaicí ná aois, caidreamh gaol fola agus pósadh nó páirtnéireacht shibhialta bhailí a bheith ann cheana féin

source: The formalities were broadly similar to the formalities for marriage
ga: B’ionann na gnásanna, den chuid ba mhó, agus na gnásanna a bhí i gceist le haghaidh pósta

source: Among other things, this meant that you had to give three months’ notice of your intention to enter into a civil partnership
ga: I measc rudaí eile, chiallaigh seo go raibh ort fógra trí mhí a thabhairt go raibh sé ar intinn agat páirtnéireacht shibhialta a iontráil

source: A civil partnership ceremony had to be held at an approved venue
ga: Bhí searmanas páirtnéireachta sibhialta le bheith ar siúl ag ionad faofa

source: Ending a civil partnership
ga: Deireadh a chur le páirtnéireacht shibhialta

source: The courts are able to grant a decree of nullity of civil partnership in broadly the same way as decrees of nullity of marriage are granted
ga: Is féidir leis na cúirteanna foraithne neamhnithe ar pháirtnéireacht shibhialta a dheonú ar an mbealach nach mór céanna a dheonaítear foraitheanta neamhnithe ar phósadh

source: The courts are also able to dissolve civil partnerships in a similar way to the granting of divorce
ga: Ina theannta sin, tá na cúirteanna in ann páirtnéireachtaí sibhialta a dhíscaoileadh ar bhealach cosúil le deonú colscartha

source: However, the rules governing the dissolution of civil partnerships are different
ga: Tá na rialacha a rialaíonn páirtnéireachtaí sibhialta a scaoileadh difriúil, áfach

source: Orders such as protection orders, maintenance orders and pension adjustment orders may be made in the course of court proceedings for the dissolution of civil partnerships in the same way as such orders may be made in judicial separation and divorce proceedings
ga: Féadfar orduithe ar nós orduithe cosanta, orduithe cothabhála agus orduithe coigeartaithe pinsin a dhéanamh i gcaitheamh imeachtaí cúirte chun páirtnéireachtaí sibhialta a scaoileadh ar an mbealach céanna gur féidir a leithéid d’orduithe a dhéanamh in imeachtaí idirscartha bhreithiúnaigh agus colscartha

source: Unlike divorce proceedings, the civil partners’ legal advisers are not required to discuss the possibility of reconciliation, mediation or other alternatives to dissolution
ga: Murab ionann agus imeachtaí colscartha, ní chaithfidh comhairleoirí dlí na bpáirtnéirí sibhialta féidearthacht athmhuintearais, idirghabhála nó roghanna eile ar scaoileadh a phlé

source: The court may, however, adjourn proceedings in order to facilitate such alternatives
ga: Féadfaidh an chúirt imeachtaí a chur ar atráth, áfach, chun a leithéid de roghanna a éascú
